Table of Contents
 Class GrpcServiceBasedReflectionClient<IReflectionService>
Namespace
IdeaStatiCa.Plugin.Grpc.Reflection
Assembly
IdeaStatiCa.Plugin.dll
WCF-like implementation of the GrpcReflectionClient that uses interceptors to proxy calls to server.
public class GrpcServiceBasedReflectionClient<IReflectionService> : GrpcClient, IGrpcClient, IGrpcCommunicator, IGrpcService, IGrpcSender where IReflectionService : class
Type Parameters
IReflectionService
Inheritance
object
GrpcClient
GrpcServiceBasedReflectionClient<IReflectionService>
Implements
IGrpcClient
IGrpcCommunicator
IGrpcService
IGrpcSender
Inherited Members
 GrpcClient.Logger
 GrpcClient.ClientConnected
 GrpcClient.ClientDisconnected
 GrpcClient.ClientID
 GrpcClient.Port
 GrpcClient.Host
 GrpcClient.IsConnected
 GrpcClient.RegisterHandler(string, IGrpcMessageHandler)
 GrpcClient.StartAsync(string, int)
 GrpcClient.StopAsync()
 GrpcClient.SendMessageAsync(GrpcMessage)
 GrpcClient.ConnectAsync(IAsyncStreamReader<GrpcMessage>, IServerStreamWriter<GrpcMessage>, ServerCallContext)
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Constructors
 GrpcServiceBasedReflectionClient(IPluginLogger)
public GrpcServiceBasedReflectionClient(IPluginLogger logger)
Parameters
logger IPluginLogger
Properties
 Service
Service used to call server methods.
public IReflectionService Service { get; }
Property Value
IReflectionService
 Edit this page